service/src/intTest/resources/illogicalmessage/MCCI_IN010000UK13_ebxml.txt

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:xsi="http://www.w3c.org/2001/XML-Schema-Instance" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0" xmlns:xlink="http://www.w3.org/1999/xlink"><SOAP:Header><eb:MessageHeader SOAP:mustUnderstand="1" eb:version="2.0"><eb:From><eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">X26-9199246</eb:PartyId></eb:From><eb:To><eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">A91576-9198964</eb:PartyId></eb:To><eb:CPAId>S918999399410</eb:CPAId><eb:ConversationId>CB3C8F33-81F9-4481-8952-246182E7483D</eb:ConversationId><eb:Service>urn:nhs:names:services:gp2gp</eb:Service><eb:Action>MCCI_IN010000UK13</eb:Action><eb:MessageData><eb:MessageId>08C23050-03C9-FBD4-C949-1900BDE2ED1A</eb:MessageId><eb:Timestamp>2021-02-03T12:59:28</eb:Timestamp><eb:RefToMessageId>332CCAAA-608F-4727-93E3-06C074CF8188</eb:RefToMessageId></eb:MessageData><eb:DuplicateElimination/></eb:MessageHeader><eb:AckRequested SOAP:mustUnderstand="1" eb:version="2.0" eb:signed="false" SOAP:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH"/></SOAP:Header><SOAP:Body><eb:Manifest SOAP:mustUnderstand="1" eb:version="2.0"><eb:Reference xlink:href="cid:08C23050-03C9-FBD4-C949-1900BDE2ED1A@spine.nhs.uk"><eb:Schema eb:location="http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd" eb:version="1.0"/><eb:Description xml:lang="en">HL7 payload</eb:Description> <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/></eb:Reference></eb:Manifest></SOAP:Body></SOAP:Envelope>